/**
 * @file
 *  [拡張] iWnn標準擬似候補作成辞書テーブル定義 (SJIS版)
 *
 * @author
 * (C) OMRON SOFTWARE Co., Ltd. 2008 All Rights Reserved.
 */
/************************************************/
/*         define  宣  言 (以下AWnnより流用)      */
/************************************************/
/*
 * 読み、擬似候補テーブル数定義
 */
#define NJ_YOMI_HIRA_MAX      83    /**< 読み文字テーブル(かな)数 */
#define NJ_YOMI_SYM_MAX       20    /**< 読み文字テーブル(記号)数 */
#define NJ_KURAI_TABLE_MAX     5    /**< 漢数字(位)テーブル数 */
#define NJ_KANSUUJI_TABLE_MAX 10    /**< 漢数字テーブル数 */

/*
 * キーアサイン定義
 *   ひらがな文字が割り付けられているキーアサイン
 */
#define NJ_NUM_0        0           /**< キー定義：0キー */
#define NJ_NUM_1        1           /**< キー定義：1キー */
#define NJ_NUM_2        2           /**< キー定義：2キー */
#define NJ_NUM_3        3           /**< キー定義：3キー */
#define NJ_NUM_4        4           /**< キー定義：4キー */
#define NJ_NUM_5        5           /**< キー定義：5キー */
#define NJ_NUM_6        6           /**< キー定義：6キー */
#define NJ_NUM_7        7           /**< キー定義：7キー */
#define NJ_NUM_8        8           /**< キー定義：8キー */
#define NJ_NUM_9        9           /**< キー定義：9キー */
#define NJ_NUM_NON (NJ_UINT16)(-1)  /**< キー定義：定義なし */

/*
 * 漢数字の桁定義
 */
#define NJ_KETA_JYUU  101   /**< 数字桁：10 */
#define NJ_KETA_HYAKU 102   /**< 数字桁：100 */
#define NJ_KETA_SEN   103   /**< 数字桁：1000 */
#define NJ_KETA_ZEN   104   /**< 数字桁：1000(読み：ぜん) */
#define NJ_KETA_MAN   1004  /**< 数字桁：10000 */
#define NJ_KETA_OKU   1008  /**< 数字桁：100000000 */
#define NJ_KETA_CHO   1012  /**< 数字桁：1000000000000 */
/* 十、百、千は、100を引くと桁数 それ以上は1000を引くと桁数 */
/** 桁数 = NJ_KETA_{JYUU|HYAKU|SEN} - NJG_SUB_CNT_JUUTOSEN */
#define NJG_SUB_CNT_JYUUTOSEN   100
/** 桁数 = NJ_KETA_{MAN|OKU|CHO} - NJG_SUB_CNT_MANTOCHO */
#define NJG_SUB_CNT_MANTOCHO   1000
#define NJG_FIND_OKUMANCHO     0x20  /**< 億万兆あり */
#define NJG_FIND_JYUUHYAKUSEN  0x21  /**< 十百千あり */


/************************************************/
/*                                              */
/* 時間・日付擬似候補定義                          */
/*                                              */
/************************************************/
/* giji_conv_table[] の要素定義 */
/* Time */
#define NJG_TBL_NO_THH        0  /**< giji_conv_table[] の要素: HH */
#define NJG_TBL_NO_TMM        1  /**< giji_conv_table[] の要素: MM */
#define NJG_TBL_NO_THM        2  /**< giji_conv_table[] の要素: HM */
#define NJG_TBL_NO_THMM       3  /**< giji_conv_table[] の要素: HMM */
#define NJG_TBL_NO_THHM       4  /**< giji_conv_table[] の要素: HHM */
#define NJG_TBL_NO_THHMM      5  /**< giji_conv_table[] の要素: HHMM */
#define NJG_TBL_NO_THMM_SYM   6  /**< giji_conv_table[] の要素: HMM_SYM */
#define NJG_TBL_NO_THHMM_SYM  7  /**< giji_conv_table[] の要素: HHMM_SYM */
/* Date */
#define NJG_TBL_NO_DYYYY      8  /**< giji_conv_table[] の要素: YYYY */
#define NJG_TBL_NO_DMM        9  /**< giji_conv_table[] の要素: MM */
#define NJG_TBL_NO_DDD        10  /**< giji_conv_table[] の要素: DDD */
#define NJG_TBL_NO_DMD        11  /**< giji_conv_table[] の要素: MD */
#define NJG_TBL_NO_DMDD       12  /**< giji_conv_table[] の要素: MDD */
#define NJG_TBL_NO_DMMD       13  /**< giji_conv_table[] の要素: MMD */
#define NJG_TBL_NO_DMMDD      14  /**< giji_conv_table[] の要素: MMDD */
#define NJG_TBL_NO_DMD_SYM    15  /**< giji_conv_table[] の要素: MD_SYM */
#define NJG_TBL_NO_DMDD_SYM   16  /**< giji_conv_table[] の要素: MDD_SYM */
#define NJG_TBL_NO_DMMD_SYM   17  /**< giji_conv_table[] の要素: MMD_SYM */
#define NJG_TBL_NO_DMMDD_SYM  18  /**< giji_conv_table[] の要素: MMDD_SYM */


/*******************************************
 * giji_suuji_tbl の定義
 *******************************************/
/* テーブルの配列要素定義 */
#define NJG_SUUJI_TBL_HAN     0  /**< テーブル配列要素:半角 */
#define NJG_SUUJI_TBL_ZEN     1  /**< テーブル配列要素:全角 */
#define NJG_SUUJI_TBL_KAN     2  /**< テーブル配列要素:漢字 */
/** 数字文字の種類定義 */
#define NJG_SUUJI_TBL_NO      3
/** 数字文字数 */
#define NJG_SUUJI_REC        11


/*******************************************
 * 「ウ゛」→「ヴ」変換処理
 *******************************************/
#define NJG_KATAKANA_U          0x8345    /**< ウ (SJIS) */
#define NJG_KATAKANA_DAKUON     0x814a    /**< ゛ (SJIS) */
#define NJG_KATAKANA_VU         0x8394    /**< ヴ (SJIS) */


/*******************************************
 * 半角数字カンマ区切り
 *******************************************/
/** カンマ記号 [,] (ASCII) */
#define NJG_COMMA_MARK  0x2c


/***********************************************************************
 * 構造体宣言
 ***********************************************************************/
/**
 * 読み文字テーブルの要素定義
 */
typedef struct {
    NJ_UINT16  yomi;      /* 読み文字 */
    NJ_UINT16  num;       /* キーアサイン番号 */
    NJ_UINT16  toggle;    /* トグル数(1〜) */
} NJ_GIJI_YOMI_TABLE;

/**
 * 数字擬似テーブルの要素定義
 */
typedef struct {
    NJ_UINT16 num;       /**< 数値データ(Hex) */
    NJ_UINT16 half;      /**< 半角数字 */
    NJ_UINT16 full;      /**< 全角数字 */
    NJ_UINT16 kanji;     /**< 漢数字(全角) */
} NJ_GIJI_SUUJI_TABLE;

/**
 * 漢数字擬似テーブルの要素定義
 */
typedef struct  {
    NJ_UINT16 yomi[3];   /**< 漢数字よみ */
    NJ_INT16  len;       /**< 読み文字長 */
    NJ_INT16  ketapos;   /**< 対応する数（十以上は桁数を表す）*/
} NJ_SUUJIYOMITBL;

/**
 * 時間擬似、日付擬似の単位変換テーブルの定義
 */
typedef struct {
    NJ_INT16 f_digit;        /**< 途中で格納する表示コードの位置 */
    NJ_UINT16 f_code;        /**< 時、月表示用コード*/
    NJ_UINT16 s_code;        /**< 分、日表示用コード*/
    NJ_INT16 code_size;      /**< 表示用コードのバイト数 */
} NJ_CONVERT_TBL;

/************************************************/
/*                 テーブル定義                   */
/************************************************/
/*************************************************
 * 読み文字テーブル
 * 
 * ※文字コードをキーとした検索を行うため、
 *   文字コード順に並べるものとする。
 * 
 * ※このキーアサインを標準としている。
 *   このアサインのうち、記号とそれ以外にテーブルを分割している。
 * 
 *     <toggle> 1   2   3   4   5   6   7   8   9  10  11
 * <KeyAssign>
 *   <  1 >    あ  い  う  え  お  ぁ  ぃ  ぅ  ぇ  ぉ    
 *   <  2 >    か  き  く  け  こ
 *   <  3 >    さ  し  す  せ  そ
 *   <  4 >    た  ち  つ  て  と  っ
 *   <  5 >    な  に  ぬ  ね  の
 *   <  6 >    は  ひ  ふ  へ  ほ
 *   <  7 >    ま  み  む  め  も
 *   <  8 >    や  ゆ  よ  ゃ  ゅ  ょ
 *   <  9 >    ら  り  る  れ  ろ
 *   <  0 >    わ  を  ん  ゎ  、  。  ー  ・  〜  ！  ？
 * 
 *   <  2 >    が  ぎ  ぐ  げ  ご
 *   <  3 >    ざ  じ  ず  ぜ  ぞ
 *   <  4 >    だ  ぢ  づ  で  ど
 *   <  6 >    ば  び  ぶ  べ  ぼ
 *   <  6 >    ぱ  ぴ  ぷ  ぺ  ぽ
 * 
 *   <なし>    ．  ＠  ／  ：  −  ＿
 * 
 */


/**
 *  読み文字 ひらがな
 */
static const NJ_GIJI_YOMI_TABLE giji_yomi_hira_tbl[NJ_YOMI_HIRA_MAX] = {
/* ぁ あ          */{0x829f, NJ_NUM_1, 6}, {0x82a0, NJ_NUM_1, 1},
/* ぃ い          */{0x82a1, NJ_NUM_1, 7}, {0x82a2, NJ_NUM_1, 2},
/* ぅ う          */{0x82a3, NJ_NUM_1, 8}, {0x82a4, NJ_NUM_1, 3},
/* ぇ え          */{0x82a5, NJ_NUM_1, 9}, {0x82a6, NJ_NUM_1, 4},
/* ぉ お          */{0x82a7, NJ_NUM_1, 10}, {0x82a8, NJ_NUM_1, 5},
/* か が          */{0x82a9, NJ_NUM_2, 1}, {0x82aa, NJ_NUM_2, 1},
/* き ぎ          */{0x82ab, NJ_NUM_2, 2}, {0x82ac, NJ_NUM_2, 2},
/* く ぐ          */{0x82ad, NJ_NUM_2, 3}, {0x82ae, NJ_NUM_2, 3},
/* け げ          */{0x82af, NJ_NUM_2, 4}, {0x82b0, NJ_NUM_2, 4},
/* こ ご          */{0x82b1, NJ_NUM_2, 5}, {0x82b2, NJ_NUM_2, 5},
/* さ ざ          */{0x82b3, NJ_NUM_3, 1}, {0x82b4, NJ_NUM_3, 1},
/* し じ          */{0x82b5, NJ_NUM_3, 2}, {0x82b6, NJ_NUM_3, 2},
/* す ず          */{0x82b7, NJ_NUM_3, 3}, {0x82b8, NJ_NUM_3, 3},
/* せ ぜ          */{0x82b9, NJ_NUM_3, 4}, {0x82ba, NJ_NUM_3, 4},
/* そ ぞ          */{0x82bb, NJ_NUM_3, 5}, {0x82bc, NJ_NUM_3, 5},
/* た だ          */{0x82bd, NJ_NUM_4, 1}, {0x82be, NJ_NUM_4, 1},
/* ち ぢ          */{0x82bf, NJ_NUM_4, 2}, {0x82c0, NJ_NUM_4, 2},
/* っ つ づ       */{0x82c1, NJ_NUM_4, 6}, {0x82c2, NJ_NUM_4, 3}, {0x82c3, NJ_NUM_4, 3},
/* て で          */{0x82c4, NJ_NUM_4, 4}, {0x82c5, NJ_NUM_4, 4},
/* と ど          */{0x82c6, NJ_NUM_4, 5}, {0x82c7, NJ_NUM_4, 5},
/* な に ぬ ね の */{0x82c8, NJ_NUM_5, 1}, {0x82c9, NJ_NUM_5, 2}, {0x82ca, NJ_NUM_5, 3}, {0x82cb, NJ_NUM_5, 4}, {0x82cc, NJ_NUM_5, 5},
/* は ば ぱ       */{0x82cd, NJ_NUM_6, 1}, {0x82ce, NJ_NUM_6, 1}, {0x82cf, NJ_NUM_6, 1},
/* ひ び ぴ       */{0x82d0, NJ_NUM_6, 2}, {0x82d1, NJ_NUM_6, 2}, {0x82d2, NJ_NUM_6, 2},
/* ふ ぶ ぷ       */{0x82d3, NJ_NUM_6, 3}, {0x82d4, NJ_NUM_6, 3}, {0x82d5, NJ_NUM_6, 3},
/* へ べ ぺ       */{0x82d6, NJ_NUM_6, 4}, {0x82d7, NJ_NUM_6, 4}, {0x82d8, NJ_NUM_6, 4},
/* ほ ぼ ぽ       */{0x82d9, NJ_NUM_6, 5}, {0x82da, NJ_NUM_6, 5}, {0x82db, NJ_NUM_6, 5},
/* ま み む め も */{0x82dc, NJ_NUM_7, 1}, {0x82dd, NJ_NUM_7, 2}, {0x82de, NJ_NUM_7, 3}, {0x82df, NJ_NUM_7, 4}, {0x82e0, NJ_NUM_7, 5},
/* ゃ や          */{0x82e1, NJ_NUM_8, 4}, {0x82e2, NJ_NUM_8, 1},
/* ゅ ゆ          */{0x82e3, NJ_NUM_8, 5}, {0x82e4, NJ_NUM_8, 2},
/* ょ よ          */{0x82e5, NJ_NUM_8, 6}, {0x82e6, NJ_NUM_8, 3},
/* ら り る れ ろ */{0x82e7, NJ_NUM_9, 1}, {0x82e8, NJ_NUM_9, 2}, {0x82e9, NJ_NUM_9, 3}, {0x82ea, NJ_NUM_9, 4}, {0x82eb, NJ_NUM_9, 5},
/* ゎ わ          */{0x82ec, NJ_NUM_0, 4}, {0x82ed, NJ_NUM_0, 1},
/* ゐ ゑ          */{0x0000, NJ_NUM_NON, 0},{0x0000, NJ_NUM_NON, 0},/* 未対応とする */
/* を ん          */{0x82f0, NJ_NUM_0, 2}, {0x82f1, NJ_NUM_0, 3}
};

/**
 * 読み文字 記号
 */
static const NJ_GIJI_YOMI_TABLE giji_yomi_sym_tbl[NJ_YOMI_SYM_MAX] = {
/* 、 */{0x8141, NJ_NUM_0, 5},
/* 。 */{0x8142, NJ_NUM_0, 6},
/* ー */{0x815b, NJ_NUM_0, 7},
/* ・ */{0x8145, NJ_NUM_0, 8},
/* 〜 */{0x8160, NJ_NUM_0, 9},
/* ！ */{0x8149, NJ_NUM_0, 10},
/* ？ */{0x8148, NJ_NUM_0, 11},
/* − */{0x817c, NJ_NUM_NON, 0},
/* ． */{0x8144, NJ_NUM_NON, 0},
/* ／ */{0x815e, NJ_NUM_NON, 0},
/* ： */{0x8146, NJ_NUM_NON, 0},
/* ＠ */{0x8197, NJ_NUM_NON, 0},
/* ＿ */{0x8151, NJ_NUM_NON, 0},
/* ， */{0x8143, NJ_NUM_NON, 0},
/* ． */{0x8144, NJ_NUM_NON, 0},
/* ゛ */{0x814a, NJ_NUM_NON, 0},
/* ゜ */{0x814b, NJ_NUM_NON, 0},
/* ＆ */{0x8195, NJ_NUM_NON, 0},
/* ＝ */{0x8181, NJ_NUM_NON, 0},
/* ヴ */{0x8394, NJ_NUM_NON, 0}
};

/*******************************************
 * 擬似候補テーブル
 * 
 *   文字コード順ではなく、読み文字テーブル
 *   の順と一致するよう並べるものとします。
 */
/**
 * 全角カタカナ
 */
/*
 * 
 * ※このキーアサインを標準としている。
 *   このアサインのうち、記号とそれ以外にテーブルを分割している。
 * 
 *     <toggle> 1   2   3   4   5   6   7   8   9  10  11
 * <KeyAssign>
 *   <  1 >    ア  イ  ウ  エ  オ  ァ  ィ  ゥ  ェ  ォ  
 *   <  2 >    カ  キ  ク  ケ  コ
 *   <  3 >    サ  シ  ス  セ  ソ
 *   <  4 >    タ  チ  ツ  テ  ト  ッ
 *   <  5 >    ナ  ニ  ヌ  ネ  ノ
 *   <  6 >    ハ  ヒ  フ  ヘ  ホ
 *   <  7 >    マ  ミ  ム  メ  モ
 *   <  8 >    ヤ  ユ  ヨ  ャ  ュ  ョ
 *   <  9 >    ラ  リ  ル  レ  ロ
 *   <  0 >    ワ  ヲ  ン  ヮ  、  。  ー  ・  〜  ！  ？
 *   
 *   <  2 >    ガ  ギ  グ  ゲ  ゴ
 *   <  3 >    ザ  ジ  ズ  ゼ  ゾ
 *   <  4 >    ダ  ヂ  ヅ  デ  ド
 *   <  6 >    バ  ビ  ブ  ベ  ボ
 *   <  6 >    パ  ピ  プ  ペ  ポ
 * 
 *   <なし>    ．  ＠  ／  ：  −  ＿
 * 
 */
static const NJ_UINT16 giji_katakana_tbl[NJ_YOMI_HIRA_MAX] = {
/* ァ ア          */ 0x8340, 0x8341,
/* ィ イ          */ 0x8342, 0x8343,
/* ゥ ウ          */ 0x8344, 0x8345,
/* ェ エ          */ 0x8346, 0x8347,
/* ォ オ          */ 0x8348, 0x8349,
/* カ ガ          */ 0x834a, 0x834b,
/* キ ギ          */ 0x834c, 0x834d,
/* ク グ          */ 0x834e, 0x834f,
/* ケ ゲ          */ 0x8350, 0x8351,
/* コ ゴ          */ 0x8352, 0x8353,
/* サ ザ          */ 0x8354, 0x8355,
/* シ ジ          */ 0x8356, 0x8357,
/* ス ズ          */ 0x8358, 0x8359,
/* セ ゼ          */ 0x835a, 0x835b,
/* ソ ゾ          */ 0x835c, 0x835d,
/* タ ダ          */ 0x835e, 0x835f,
/* チ ヂ          */ 0x8360, 0x8361,
/* ッ ツ ヅ       */ 0x8362, 0x8363, 0x8364,
/* テ デ          */ 0x8365, 0x8366,
/* ト ド          */ 0x8367, 0x8368,
/* ナ ニ ヌ ネ ノ */ 0x8369, 0x836a, 0x836b, 0x836c, 0x836d,
/* ハ バ パ       */ 0x836e, 0x836f, 0x8370,
/* ヒ ビ ピ       */ 0x8371, 0x8372, 0x8373,
/* フ ブ プ       */ 0x8374, 0x8375, 0x8376,
/* ヘ ベ ペ       */ 0x8377, 0x8378, 0x8379,
/* ホ ボ ポ       */ 0x837a, 0x837b, 0x837c,
/* マ ミ ム メ モ */ 0x837d, 0x837e, 0x8380, 0x8381, 0x8382,
/* ャ ヤ          */ 0x8383, 0x8384,
/* ュ ユ          */ 0x8385, 0x8386,
/* ョ ヨ          */ 0x8387, 0x8388,
/* ラ リ ル レ ロ */ 0x8389, 0x838a, 0x838b, 0x838c, 0x838d,
/* ヮ ワ          */ 0x838e, 0x838f,
/* ゐ ゑ          */ 0x0000, 0x0000, /* 未対応とする */
/* ヲ ン          */ 0x8392, 0x8393
};

/** 全角カタカナ 記号 */
static const NJ_UINT16 giji_katakana_sym_tbl[NJ_YOMI_SYM_MAX] = {
/* 、 */ 0x8141, 
/* 。 */ 0x8142, 
/* ー */ 0x815b, 
/* ・ */ 0x8145, 
/* 〜 */ 0x8160, 
/* ！ */ 0x8149, 
/* ？ */ 0x8148, 
/* − */ 0x817c, 
/* ． */ 0x8144, 
/* ／ */ 0x815e, 
/* ： */ 0x8146, 
/* ＠ */ 0x8197, 
/* ＿ */ 0x8151, 
/* ， */ 0x8143, 
/* ． */ 0x8144, 
/* ゛ */ 0x814a, 
/* ゜ */ 0x814b, 
/* ＆ */ 0x8195, 
/* ＝ */ 0x8181,
/* ヴ */ 0x8394
};

/**
 * 半角カタカナ
 */
/*
 * 
 * ※このキーアサインを標準としている。(実際は半角)
 *   このアサインのうち、記号とそれ以外にテーブルを分割している。
 * 
 *     <toggle> 1   2   3   4   5   6   7   8   9  10  11
 * <KeyAssign>
 *   <  1 >    ア  イ  ウ  エ  オ  ァ  ィ  ゥ  ェ  ォ
 *   <  2 >    カ  キ  ク  ケ  コ
 *   <  3 >    サ  シ  ス  セ  ソ
 *   <  4 >    タ  チ  ツ  テ  ト  ッ
 *   <  5 >    ナ  ニ  ヌ  ネ  ノ
 *   <  6 >    ハ  ヒ  フ  ヘ  ホ
 *   <  7 >    マ  ミ  ム  メ  モ
 *   <  8 >    ヤ  ユ  ヨ  ャ  ュ  ョ
 *   <  9 >    ラ  リ  ル  レ  ロ
 *   <  0 >    ワ  ヲ  ン      、  。  ー  ・  〜  ！  ？
 *   
 *   <  2 >    ガ  ギ  グ  ゲ  ゴ
 *   <  3 >    ザ  ジ  ズ  ゼ  ゾ
 *   <  4 >    ダ  ヂ  ヅ  デ  ド
 *   <  6 >    バ  ビ  ブ  ベ  ボ
 *   <  6 >    パ  ピ  プ  ペ  ポ
 * 
 *   <なし>    ．  ＠  ／  ：  −  ＿
 * 
 */
static const NJ_UINT16 giji_hankata_tbl[NJ_YOMI_HIRA_MAX][2] = {
/* ァ ア          */ {0x00a7, 0x0000}, {0x00b1, 0x0000},
/* ィ イ          */ {0x00a8, 0x0000}, {0x00b2, 0x0000},
/* ゥ ウ          */ {0x00a9, 0x0000}, {0x00b3, 0x0000},
/* ェ エ          */ {0x00aa, 0x0000}, {0x00b4, 0x0000},
/* ォ オ          */ {0x00ab, 0x0000}, {0x00b5, 0x0000},
/* カ ガ          */ {0x00b6, 0x0000}, {0x00b6, 0x00de},
/* キ ギ          */ {0x00b7, 0x0000}, {0x00b7, 0x00de},
/* ク グ          */ {0x00b8, 0x0000}, {0x00b8, 0x00de},
/* ケ ゲ          */ {0x00b9, 0x0000}, {0x00b9, 0x00de},
/* コ ゴ          */ {0x00ba, 0x0000}, {0x00ba, 0x00de},
/* サ ザ          */ {0x00bb, 0x0000}, {0x00bb, 0x00de},
/* シ ジ          */ {0x00bc, 0x0000}, {0x00bc, 0x00de},
/* ス ズ          */ {0x00bd, 0x0000}, {0x00bd, 0x00de},
/* セ ゼ          */ {0x00be, 0x0000}, {0x00be, 0x00de},
/* ソ ゾ          */ {0x00bf, 0x0000}, {0x00bf, 0x00de},
/* タ ダ          */ {0x00c0, 0x0000}, {0x00c0, 0x00de},
/* チ ヂ          */ {0x00c1, 0x0000}, {0x00c1, 0x00de},
/* ッ ツ ヅ       */ {0x00af, 0x0000}, {0x00c2, 0x0000}, {0x00c2, 0x00de},
/* テ デ          */ {0x00c3, 0x0000}, {0x00c3, 0x00de},
/* ト ド          */ {0x00c4, 0x0000}, {0x00c4, 0x00de},
/* ナ ニ ヌ ネ ノ */ {0x00c5, 0x0000}, {0x00c6, 0x0000}, {0x00c7, 0x0000}, {0x00c8, 0x0000}, {0x00c9, 0x0000},
/* ハ バ パ       */ {0x00ca, 0x0000}, {0x00ca, 0x00de}, {0x00ca, 0x00df},
/* ヒ ビ ピ       */ {0x00cb, 0x0000}, {0x00cb, 0x00de}, {0x00cb, 0x00df},
/* フ ブ プ       */ {0x00cc, 0x0000}, {0x00cc, 0x00de}, {0x00cc, 0x00df},
/* ヘ ベ ペ       */ {0x00cd, 0x0000}, {0x00cd, 0x00de}, {0x00cd, 0x00df},
/* ホ ボ ポ       */ {0x00ce, 0x0000}, {0x00ce, 0x00de}, {0x00ce, 0x00df},
/* マ ミ ム メ モ */ {0x00cf, 0x0000}, {0x00d0, 0x0000}, {0x00d1, 0x0000}, {0x00d2, 0x0000}, {0x00d3, 0x0000},
/* ャ ヤ          */ {0x00ac, 0x0000}, {0x00d4, 0x0000},
/* ュ ユ          */ {0x00ad, 0x0000}, {0x00d5, 0x0000},
/* ョ ヨ          */ {0x00ae, 0x0000}, {0x00d6, 0x0000},
/* ラ リ ル レ ロ */ {0x00d7, 0x0000}, {0x00d8, 0x0000}, {0x00d9, 0x0000}, {0x00da, 0x0000}, {0x00db, 0x0000},
/* ヮ ワ          */ {0x00dc, 0x0000}, {0x00dc, 0x0000},
/* ゐ ゑ          */ {0x0000, 0x0000}, {0x0000, 0x0000},
/* ヲ ン          */ {0x00a6, 0x0000}, {0x00dd, 0x0000}
};

/** 半角カタカナ 記号 */
static const NJ_UINT16 giji_hankata_sym_tbl[NJ_YOMI_SYM_MAX][2] = {
/* 、 */ {0x00a4, 0x0000},
/* 。 */ {0x00a1, 0x0000},
/* ー */ {0x00b0, 0x0000},
/* ・ */ {0x00a5, 0x0000},
/* 〜 */ {0x007e, 0x0000},
/* ！ */ {0x0021, 0x0000},
/* ？ */ {0x003f, 0x0000},
/* − */ {0x002d, 0x0000},
/* ． */ {0x002e, 0x0000},
/* ／ */ {0x002f, 0x0000},
/* ： */ {0x003a, 0x0000},
/* ＠ */ {0x0040, 0x0000},
/* ＿ */ {0x005f, 0x0000},
/* ， */ {0x002c, 0x0000},
/* ． */ {0x002e, 0x0000},
/* ゛ */ {0x00de, 0x0000},
/* ゜ */ {0x00df, 0x0000},
/* ＆ */ {0x0026, 0x0000},
/* ＝ */ {0x003d, 0x0000},
/* ヴ */ {0x00b3, 0x00de}
};

/**
 * 全角英字 大文字
 */
/*
 * 
 * ※大文字、小文字ともに、このキーアサインを標準としている。
 * 
 *     <toggle> 1   2   3   4   5   6   7   8   9  10  11
 * <KeyAssign>
 *   <  1 >    ．  ＠  −  ＿  ／  ：  〜
 *   <  2 >    ａ  ｂ  ｃ
 *   <  3 >    ｄ  ｅ  ｆ
 *   <  4 >    ｇ  ｈ  ｉ
 *   <  5 >    ｊ  ｋ  ｌ
 *   <  6 >    ｍ  ｎ  ｏ
 *   <  7 >    ｐ  ｑ  ｒ  ｓ
 *   <  8 >    ｔ  ｕ  ｖ
 *   <  9 >    ｗ  ｘ  ｙ  ｚ
 *   <  0 >    
 *   
 *   <  2 >    ａ  ｂ  ｃ
 *   <  3 >    ｄ  ｅ  ｆ
 *   <  4 >    ｇ  ｈ  ｉ
 *   <  6 >    ｍ  ｎ  ｏ
 *   <  6 >    ｍ  ｎ  ｏ
 * 
 */
static const NJ_UINT16 giji_zen_eiji_upper_tbl[NJ_YOMI_HIRA_MAX] = {
/* ぁ あ          *//* ： ．       */ 0x8146, 0x8144,
/* ぃ い          *//* 〜 ＠       */ 0x8160, 0x8197,
/* ぅ う          *//*    −       */ 0x0000, 0x817c,
/* ぇ え          *//*    ＿       */ 0x0000, 0x8151,
/* ぉ お          *//*    ／       */ 0x0000, 0x815e,
/* か が          *//* Ａ Ａ       */ 0x8260, 0x8260,
/* き ぎ          *//* Ｂ Ｂ       */ 0x8261, 0x8261,
/* く ぐ          *//* Ｃ Ｃ       */ 0x8262, 0x8262,
/* け げ          *//*             */ 0x0000, 0x0000,
/* こ ご          *//*             */ 0x0000, 0x0000,
/* さ ざ          *//* Ｄ Ｄ       */ 0x8263, 0x8263,
/* し じ          *//* Ｅ Ｅ       */ 0x8264, 0x8264,
/* す ず          *//* Ｆ Ｆ       */ 0x8265, 0x8265,
/* せ ぜ          *//*             */ 0x0000, 0x0000,
/* そ ぞ          *//*             */ 0x0000, 0x0000,
/* た だ          *//* Ｇ Ｇ       */ 0x8266, 0x8266,
/* ち ぢ          *//* Ｈ Ｈ       */ 0x8267, 0x8267,
/* っ つ づ       *//*    Ｉ Ｉ    */ 0x0000, 0x8268, 0x8268,
/* て で          *//*             */ 0x0000, 0x0000,
/* と ど          *//*             */ 0x0000, 0x0000,
/* な に ぬ ね の *//* Ｊ Ｋ Ｌ    */ 0x8269, 0x826a, 0x826b, 0x0000, 0x0000,
/* は ば ぱ       *//* Ｍ Ｍ Ｍ    */ 0x826c, 0x826c, 0x826c,
/* ひ び ぴ       *//* Ｎ Ｎ Ｎ    */ 0x826d, 0x826d, 0x826d,
/* ふ ぶ ぷ       *//* Ｏ Ｏ Ｏ    */ 0x826e, 0x826e, 0x826e,
/* へ べ ぺ       *//*             */ 0x0000, 0x0000, 0x0000,
/* ほ ぼ ぽ       *//*             */ 0x0000, 0x0000, 0x0000,
/* ま み む め も *//* Ｐ Ｑ Ｒ Ｓ */ 0x826f, 0x8270, 0x8271, 0x8272, 0x0000,
/* ゃ や          *//*    Ｔ       */ 0x0000, 0x8273,
/* ゅ ゆ          *//*    Ｕ       */ 0x0000, 0x8274,
/* ょ よ          *//*    Ｖ       */ 0x0000, 0x8275,
/* ら り る れ ろ *//* Ｗ Ｘ Ｙ Ｚ */ 0x8276, 0x8277, 0x8278, 0x8279, 0x0000,
/* ゎ わ          *//*             */ 0x0000, 0x0000,
/* ゐ ゑ          *//*             */ 0x0000, 0x0000,
/* を ん          *//*             */ 0x0000, 0x0000
};

/**
 * 全角英字 小文字
 */
static const NJ_UINT16 giji_zen_eiji_lower_tbl[NJ_YOMI_HIRA_MAX] = {
/* ぁ あ          *//* ： ．          */ 0x8146, 0x8144,
/* ぃ い          *//* 〜 ＠          */ 0x8160, 0x8197,
/* ぅ う          *//*    −          */ 0x0000, 0x817c,
/* ぇ え          *//*    ＿          */ 0x0000, 0x8151,
/* ぉ お          *//*    ／          */ 0x0000, 0x815e,
/* か が          *//* ａ ａ          */ 0x8281, 0x8281,
/* き ぎ          *//* ｂ ｂ          */ 0x8282, 0x8282,
/* く ぐ          *//* ｃ ｃ          */ 0x8283, 0x8283,
/* け げ          *//*                */ 0x0000, 0x0000,
/* こ ご          *//*                */ 0x0000, 0x0000,
/* さ ざ          *//* ｄ ｄ          */ 0x8284, 0x8284,
/* し じ          *//* ｅ ｅ          */ 0x8285, 0x8285,
/* す ず          *//* ｆ ｆ          */ 0x8286, 0x8286,
/* せ ぜ          *//*                */ 0x0000, 0x0000,
/* そ ぞ          *//*                */ 0x0000, 0x0000,
/* た だ          *//* ｇ ｇ          */ 0x8287, 0x8287,
/* ち ぢ          *//* ｈ ｈ          */ 0x8288, 0x8288,
/* っ つ づ       *//*    ｉ ｉ       */ 0x0000, 0x8289, 0x8289,
/* て で          *//*                */ 0x0000, 0x0000,
/* と ど          *//*                */ 0x0000, 0x0000,
/* な に ぬ ね の *//* ｊ ｋ ｌ       */ 0x828a, 0x828b, 0x828c, 0x0000, 0x0000,
/* は ば ぱ       *//* ｍ ｍ ｍ       */ 0x828d, 0x828d, 0x828d,
/* ひ び ぴ       *//* ｎ ｎ ｎ       */ 0x828e, 0x828e, 0x828e,
/* ふ ぶ ぷ       *//* ｏ ｏ ｏ       */ 0x828f, 0x828f, 0x828f,
/* へ べ ぺ       *//*                */ 0x0000, 0x0000, 0x0000,
/* ほ ぼ ぽ       *//*                */ 0x0000, 0x0000, 0x0000,
/* ま み む め も *//* ｐ ｑ ｒ ｓ    */ 0x8290, 0x8291, 0x8292, 0x8293, 0x0000,
/* ゃ や          *//*    ｔ          */ 0x0000, 0x8294,
/* ゅ ゆ          *//*    ｕ          */ 0x0000, 0x8295,
/* ょ よ          *//*    ｖ          */ 0x0000, 0x8296,
/* ら り る れ ろ *//* ｗ ｘ ｙ ｚ    */ 0x8297, 0x8298, 0x8299, 0x829a, 0x0000,
/* ゎ わ          *//*                */ 0x0000, 0x0000,
/* ゐ ゑ          *//*                */ 0x0000, 0x0000,
/* を ん          *//*                */ 0x0000, 0x0000
};

/**
 * 半角英字 大文字
 */
/*
 * 
 * ※大文字、小文字ともに、このキーアサインを標準としている。
 * 
 *     <toggle> 1   2   3   4   5   6   7   8   9  10  11
 * <KeyAssign>
 *   <  1 >     .   @   -   _   /   :   ~
 *   <  2 >     a   b   c
 *   <  3 >     d   e   f
 *   <  4 >     g   h   i
 *   <  5 >     j   k   l
 *   <  6 >     m   n   o
 *   <  7 >     p   q   r   s
 *   <  8 >     t   u   f
 *   <  9 >     w   x   y   z
 *   <  0 >    
 *   
 *   <  2 >     a   b   c
 *   <  3 >     d   e   f
 *   <  4 >     g   h   i
 *   <  6 >     m   n   o
 *   <  6 >     m   n   o
 */
static const NJ_UINT16 giji_han_eiji_upper_tbl[NJ_YOMI_HIRA_MAX] = {
/* ぁ あ          *//* : .．     */ 0x003a, 0x002e,
/* ぃ い          *//* ~ @       */ 0x007e, 0x0040,
/* ぅ う          *//*   -       */ 0x0000, 0x002d,
/* ぇ え          *//*   _       */ 0x0000, 0x005f,
/* ぉ お          *//*   /       */ 0x0000, 0x002f,
/* か が          *//* A A       */ 0x0041, 0x0041,
/* き ぎ          *//* B B       */ 0x0042, 0x0042,
/* く ぐ          *//* C C       */ 0x0043, 0x0043,
/* け げ          *//*           */ 0x0000, 0x0000,
/* こ ご          *//*           */ 0x0000, 0x0000,
/* さ ざ          *//* D D       */ 0x0044, 0x0044,
/* し じ          *//* E E       */ 0x0045, 0x0045,
/* す ず          *//* F F       */ 0x0046, 0x0046,
/* せ ぜ          *//*           */ 0x0000, 0x0000,
/* そ ぞ          *//*           */ 0x0000, 0x0000,
/* た だ          *//* G G       */ 0x0047, 0x0047,
/* ち ぢ          *//* H H       */ 0x0048, 0x0048,
/* っ つ づ       *//*    I I    */ 0x0000, 0x0049, 0x0049,
/* て で          *//*           */ 0x0000, 0x0000,
/* と ど          *//*           */ 0x0000, 0x0000,
/* な に ぬ ね の *//* J K L     */ 0x004a, 0x004b, 0x004c, 0x0000, 0x0000,
/* は ば ぱ       *//* M M M     */ 0x004d, 0x004d, 0x004d,
/* ひ び ぴ       *//* N N N     */ 0x004e, 0x004e, 0x004e,
/* ふ ぶ ぷ       *//* O O O     */ 0x004f, 0x004f, 0x004f,
/* へ べ ぺ       *//*           */ 0x0000, 0x0000, 0x0000,
/* ほ ぼ ぽ       *//*           */ 0x0000, 0x0000, 0x0000,
/* ま み む め も *//* P Q R S   */ 0x0050, 0x0051, 0x0052, 0x0053, 0x0000,
/* ゃ や          *//*   T       */ 0x0000, 0x0054,
/* ゅ ゆ          *//*   U       */ 0x0000, 0x0055,
/* ょ よ          *//*   V       */ 0x0000, 0x0056,
/* ら り る れ ろ *//* W X Y Z   */ 0x0057, 0x0058, 0x0059, 0x005a, 0x0000,
/* ゎ わ          *//*           */ 0x0000, 0x0000,
/* ゐ ゑ          *//*           */ 0x0000, 0x0000,
/* を ん          *//*           */ 0x0000, 0x0000
};

/**
 * 半角英字 小文字
 */
static const NJ_UINT16 giji_han_eiji_lower_tbl[NJ_YOMI_HIRA_MAX] = {
/* ぁ あ          *//* : .．     */ 0x003a, 0x002e,
/* ぃ い          *//* ~ @       */ 0x007e, 0x0040,
/* ぅ う          *//*   -       */ 0x0000, 0x002d,
/* ぇ え          *//*   _       */ 0x0000, 0x005f,
/* ぉ お          *//*   /       */ 0x0000, 0x002f,
/* か が          *//* a a       */ 0x0061, 0x0061,
/* き ぎ          *//* b b       */ 0x0062, 0x0062,
/* く ぐ          *//* c c       */ 0x0063, 0x0063,
/* け げ          *//*           */ 0x0000, 0x0000,
/* こ ご          *//*           */ 0x0000, 0x0000,
/* さ ざ          *//* d d       */ 0x0064, 0x0064,
/* し じ          *//* e e       */ 0x0065, 0x0065,
/* す ず          *//* f f       */ 0x0066, 0x0066,
/* せ ぜ          *//*           */ 0x0000, 0x0000,
/* そ ぞ          *//*           */ 0x0000, 0x0000,
/* た だ          *//* g g       */ 0x0067, 0x0067,
/* ち ぢ          *//* h h       */ 0x0068, 0x0068,
/* っ つ づ       *//*    i i    */ 0x0000, 0x0069, 0x0069,
/* て で          *//*           */ 0x0000, 0x0000,
/* と ど          *//*           */ 0x0000, 0x0000,
/* な に ぬ ね の *//* j k l     */ 0x006a, 0x006b, 0x006c, 0x0000, 0x0000,
/* は ば ぱ       *//* m m m     */ 0x006d, 0x006d, 0x006d,
/* ひ び ぴ       *//* n n n     */ 0x006e, 0x006e, 0x006e,
/* ふ ぶ ぷ       *//* o o o     */ 0x006f, 0x006f, 0x006f,
/* へ べ ぺ       *//*           */ 0x0000, 0x0000, 0x0000,
/* ほ ぼ ぽ       *//*           */ 0x0000, 0x0000, 0x0000,
/* ま み む め も *//* p q r s   */ 0x0070, 0x0071, 0x0072, 0x0073, 0x0000,
/* ゃ や          *//*   t       */ 0x0000, 0x0074,
/* ゅ ゆ          *//*   u       */ 0x0000, 0x0075,
/* ょ よ          *//*   v       */ 0x0000, 0x0076,
/* ら り る れ ろ *//* w x y z   */ 0x0077, 0x0078, 0x0079, 0x007a, 0x0000,
/* ゎ わ          *//*           */ 0x0000, 0x0000,
/* ゐ ゑ          *//*           */ 0x0000, 0x0000,
/* を ん          *//*           */ 0x0000, 0x0000
};

/**
 * 半角数字、全角数字、漢数字(全角)
 */
static const NJ_UINT16 giji_suuji_tbl[NJG_SUUJI_TBL_NO][NJG_SUUJI_REC] = {
/* 半角数字 */
/* 0, 1, 2, 3, 4, 5, 6, 7, 8, 9 */
{0x0030, 0x0031, 0x0032, 0x0033, 0x0034,
 0x0035, 0x0036, 0x0037, 0x0038, 0x0039,
 0x0000},

/* 全角数字 */
/* ０, １, ２, ３, ４, ５, ６, ７, ８, ９ */
{0x824f, 0x8250, 0x8251, 0x8252, 0x8253,
 0x8254, 0x8255, 0x8256, 0x8257, 0x8258,
 0x0000},

/* 漢数字(全角) 必ず2byte文字を指定すること */
{0x815a, 0x88ea, 0x93f1, 0x8e4f, 0x8e6c,
 0x8cdc, 0x985a, 0x8eb5, 0x94aa, 0x8be3,
 0x0000}
};


/**
 * 漢数字(位)
 *
 * @attention 必ず2byte文字を指定すること
 */
static const NJ_UINT16 kurai_ksuuji_table[NJ_KURAI_TABLE_MAX] = {
/* 十 */ 0x8f5c,
/* 百 */ 0x9553,
/* 千 */ 0x90e7,
/* 万 */ 0x969c,
/* 億 */ 0x89ad
};

/**
 * 漢数字
 *
 * 読み文字と漢数字を定義する。
 *
 * @attention  必ず読みで降順ソートしておくこと。
 */
static const NJ_SUUJIYOMITBL giji_suuji_yomi_tbl[] = {
    {{ 0x82eb, 0x82c1, 0x0000 }, 2, 6},             /* ろっ */
    {{ 0x82eb, 0x82ad, 0x0000 }, 2, 6},             /* ろく */
    {{ 0x82e6, 0x82f1, 0x0000 }, 2, 4},             /* よん */
    {{ 0x82dc, 0x82f1, 0x0000 }, 2, NJ_KETA_MAN},   /* まん */
    {{ 0x82d2, 0x82e1, 0x82ad }, 3, NJ_KETA_HYAKU}, /* ぴゃく */
    {{ 0x82d1, 0x82e1, 0x82ad }, 3, NJ_KETA_HYAKU}, /* びゃく */
    {{ 0x82d0, 0x82e1, 0x82c1 }, 3, NJ_KETA_HYAKU}, /* ひゃっ */
    {{ 0x82d0, 0x82e1, 0x82ad }, 3, NJ_KETA_HYAKU}, /* ひゃく */
    {{ 0x82cd, 0x82c1, 0x0000 }, 2, 8},             /* はっ */
    {{ 0x82cd, 0x82bf, 0x0000 }, 2, 8},             /* はち */
    {{ 0x82c9, 0x0000, 0x0000 }, 1, 2},             /* に */
    {{ 0x82c8, 0x82c8, 0x0000 }, 2, 7},             /* なな */
    {{ 0x82ba, 0x82f1, 0x0000 }, 2, NJ_KETA_ZEN},   /* ぜん */
    {{ 0x82b9, 0x82f1, 0x0000 }, 2, NJ_KETA_SEN},   /* せん */
    {{ 0x82b6, 0x82e3, 0x82c1 }, 3, NJ_KETA_JYUU},  /* じゅっ */
    {{ 0x82b6, 0x82e3, 0x82a4 }, 3, NJ_KETA_JYUU},  /* じゅう */
    {{ 0x82b5, 0x82bf, 0x0000 }, 2, 7},             /* しち */
    {{ 0x82b3, 0x82f1, 0x0000 }, 2, 3},             /* さん */
    {{ 0x82b2, 0x0000, 0x0000 }, 1, 5},             /* ご */
    {{ 0x82ab, 0x82e3, 0x82a4 }, 3, 9},             /* きゅう */
    {{ 0x82a8, 0x82ad, 0x0000 }, 2, NJ_KETA_OKU},   /* おく */
    {{ 0x82a2, 0x82c1, 0x0000 }, 2, 1},             /* いっ */
    {{ 0x82a2, 0x82bf, 0x0000 }, 2, 1},             /* いち */
    {{ 0x0000, 0x0000, 0x0000 }, 0, 0}
};

/**
 * 時間・日付擬似候補変換テーブル定義
 *
 *  - 時間、日付識別コード
 *  - 有効桁(文字)数 (0は無制限)
 *  - モード種別(チェックで使用する)
 *  - 擬似候補の途中に単位を格納する桁の位置
 *  - 単位文字コードの全バイト数
 *  - 擬似候補の途中に格納する単位の文字コード
 *  - 最後に格納する単位の文字コード
 */
static const NJ_CONVERT_TBL  giji_conv_table[] = {
    /* Time */
    { 0, 0x0000, 0x8E9E, 2 }, /* NJG_TBL_NO_THH *//* HH時 */
    { 0, 0x0000, 0x95AA, 2 }, /* NJG_TBL_NO_TMM *//* MM分 */
    { 1, 0x8E9E, 0x95AA, 4 }, /* NJG_TBL_NO_THM *//* H時M分 */
    { 1, 0x8E9E, 0x95AA, 4 }, /* NJG_TBL_NO_THMM *//* H時MM分 */
    { 2, 0x8E9E, 0x95AA, 4 }, /* NJG_TBL_NO_THHM *//* HH時M分 */
    { 2, 0x8E9E, 0x95AA, 4 }, /* NJG_TBL_NO_THHMM *//* HH時MM分 */
    { 1, 0x003A, 0x0000, 1 }, /* NJG_TBL_NO_THMM_SYM *//* H:MM */
    { 2, 0x003A, 0x0000, 1 }, /* NJG_TBL_NO_THHMM_SYM *//* HH:MM */
    /* Date */
    { 0, 0x0000, 0x944E, 2 }, /* NJG_TBL_NO_YYYY *//* YYYY年 */
    { 0, 0x0000, 0x8C8E, 2 }, /* NJG_TBL_NO_DMM *//* MM月 */
    { 0, 0x0000, 0x93FA, 2 }, /* NJG_TBL_NO_DDD *//* DD日 */
    { 1, 0x8C8E, 0x93FA, 4 }, /* NJG_TBL_NO_DMD *//* M月D日 */
    { 1, 0x8C8E, 0x93FA, 4 }, /* NJG_TBL_NO_DMDD *//* M月DD日 */
    { 2, 0x8C8E, 0x93FA, 4 }, /* NJG_TBL_NO_DMMD *//* MM月D日 */
    { 2, 0x8C8E, 0x93FA, 4 }, /* NJG_TBL_NO_DMMDD *//* MM月DD日 */
    { 1, 0x002F, 0x0000, 1 }, /* NJG_TBL_NO_DMD_SYM *//* M/D */
    { 1, 0x002F, 0x0000, 1 }, /* NJG_TBL_NO_DMDD_SYM *//* M/DD */
    { 2, 0x002F, 0x0000, 1 }, /* NJG_TBL_NO_DMMD_SYM *//* MM/D */
    { 2, 0x002F, 0x0000, 1 }, /* NJG_TBL_NO_DMMDD_SYM *//* MM/DD */
    {0,0,0,0}
};

/**
 * 月末日指定テーブル定義
 *
 *  - 各月の最後の日付をテーブルに格納
 *  - 先頭から順に、1月、2月、...、12月となっている(2月は29日を格納)
 */
static const NJ_UINT8 giji_last_day[12] = {
    31, /*  1月 */
    29, /*  2月 */
    31, /*  3月 */
    30, /*  4月 */
    31, /*  5月 */
    30, /*  6月 */
    31, /*  7月 */
    31, /*  8月 */
    30, /*  9月 */
    31, /* 10月 */
    30, /* 11月 */
    31  /* 12月 */
};
